{
    "data": [
        {
            "KnowledgeBaseArticle": {
                "id": "1",
                "title": "Common problems with coffee makers - Ideas by Mr Right",
                "url": "https://www.mrright.in/ideas/appliances/small-appliances/common-problems-arise-coffee-makers/",
                "content": "If you are a coffee lover, then you would know how handy and useful an electric coffee maker can prove to be.  Not only does it help you get freshly brewed coffee at home but also at the workplace.  These days, coffee makers are very easily available and tagged at reasonable rates and this is why you see them around so often. But if you are thinking of buying one, then you should be aware of the common problems that can arise. The following is a list of some of these problems that you must not ignore:",
                "provider": "mindtouch",
                "publishedDate": "Mar 13, 2017",
                "tags": [
                    "Troubleshooting",
                    "Coffeemaker"
                ],
                "views": 88,
                "likes": 45,
                "dislikes": 7,
                "author": "Matilda Burton"
            }
        },
        {
            "KnowledgeBaseArticle": {
                "id": "2",
                "title": "Drip Coffee Maker Problems: What Can Go Wrong with Your Coffee Maker",
                "url": "https://home.howstuffworks.com/coffee-maker4.htm",
                "content": "You're groggy. The sky still looks the same as when you started snoozing the night before and you stumble into the kitchen gung-ho to flip that magic switch. But what's this? You turned it on and nothing happened. No cheerful gurgling, no promising rumbling. No coffee! Here are some of the most common problems that can cause your drip coffee maker to stop working:足",
                "provider": "mindtouch",
                "publishedDate": "Feb 24, 2019",
                "tags": [
                    "Coffee Brewing",
                    "Coffeemaker"
                ],
                "views": 88,
                "likes": 31,
                "dislikes": 10,
                "author": "Jordan Simon"
            }
        },
        {
            "KnowledgeBaseArticle": {
                "id": "3",
                "title": "How to Repair a Coffee Maker - How to Repair Small Appliances",
                "url": "https://home.howstuffworks.com/how-to-repair-small-appliances3.htm",
                "content": "There's nothing more invigorating in the morning than the smell of fresh coffee -- nor anything more frustrating than the sight of a coffee maker that isn't functioning as directed. Fortunately, many repairs to coffee makers are simple to perform and require only basic tools. So, before you toss that coffee maker or defect to a coffee shop, consider how coffee makers work and what to do when they don't.足",
                "provider": "mindtouch",
                "publishedDate": "Feb 13, 2019",
                "tags": [
                    "Coffee Brewing",
                    "Coffeemaker"
                ],
                "views": 88,
                "likes": 25,
                "dislikes": 12,
                "author": "Blake Williamsoon"
            }
        },
        {
            "KnowledgeBaseArticle": {
                "id": "4",
                "title": "Repair Your Clogged Coffee Maker: 6 Steps (with Pictures)",
                "url": "https://www.instructables.com/id/Repair-Your-Clogged-Coffee-Maker/足",
                "content": "Don't throw away your coffee maker just because it only makes steam and has stopped gurgling water up into the brew basket.  I have repaired a couple coffee makers by forcefully spraying water into the fill area.(Unplug first of course).   This clears the pipes going down into the heating element area. This method didn't work on my expensive MR-COFFEE machine.  So i was forced to remove the cover and find what was clogging it up. This is not very hard to do and you don't need many tools.",
                "provider": "mindtouch",
                "publishedDate": "Jan 1, 2019",
                "tags": [
                    "Warranty",
                    "Warranty Coverage"
                ],
                "views": 88,
                "likes": 12,
                "dislikes": 0,
                "author": "Blake Williamsoon"
            }
        },
        {
            "KnowledgeBaseArticle": {
                "id": "5",
                "title": "Troubleshooting a Coffeemaker",
                "url": "https://www.doityourself.com/stry/troubleshooting-a-coffeemaker足",
                "content": "A coffeemaker can suddenly stop working for several different reasons. Most of the time it is mineral build up that is causing your coffeemaker to have problems. This could alter the taste of your coffee as well as do damage to your machine. Being able to understand the problem before it gets out of hand will save you the hassle and money of having to buy a brand new machine. Below are a few tips and hints to help you know what to look for when your coffeemaker starts to give your problems.",
                "provider": "mindtouch",
                "publishedDate": "Mar 23, 2016",
                "tags": [
                    "Coffeemaker",
                    "Troubleshooting"
                ],
                "views": 88,
                "likes": 17,
                "dislikes": 0,
                "author": "Chris Notap"
            }
        }
    ]
}